#Подготовить топ 20 вопросов по Python

#1.Что такое Python и какие преимущества он предоставляет?
#2.В чем разница между интерпретируемым и компилируемым языками программирования?
#3.Какая разница между Python 2 и Python 3?
#4.Что такое "байт-код" (bytecode) в Python?
#5.Что означает динамическая типизация в Python?
#6.Как объявить переменную в Python?
#7.Какие правила именования переменных существуют?
#8.Какие операторы доступны в Python для выполнения математических операций?
#9.Как создать комментарии в Python?
#10.Как объявить и использовать строки (strings) в Python?
#11.Как создать и манипулировать списками (lists) в Python?
#12.Что такое срезы (slices) в Python, и как они работают?
#13.Как создать кортежи (tuples) и в чем их отличие от списков?
#14.Какие операции доступны для множеств (sets) в Python?
#15.Что такое словари (dictionaries), и как они используются?
#16.Какие условные операторы используются в Python (if, elif, else)?
#17.Как работают циклы (for и while) в Python?
#18.Как прервать выполнение цикла в Python с помощью операторов break и continue?
#19.Что такое генераторы (generators), и как они работают?
#20.Что такое исключения (exceptions), и как их обрабатывать в Python?